import re

# 1. Описываем наши правила (пока возьмем email и паспорт из примера VK)
RULES = {
    "email": {
        # Регулярка из брифа
        "pattern": r"([a-zA-Z0-9._%+-]+)(@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,})",
        # Функция, которая решает, как маскировать найденный кусок
        "replacer": lambda match: match.group(1)[0] + "***" + match.group(2),
        # Объяснение: берем первую букву логина (match.group(1)[0]),
        # добавляем *** и приклеиваем домен (match.group(2))
    },
    "passport": {
        # Регулярка для паспорта (4 цифры, пробел, 6 цифр)
        "pattern": r"(\d{4})\s?(\d{6})",
        "replacer": lambda match: "**** ******",  # Просто меняем всё на звездочки
    },
    "snils": {
        # \d — это любая цифра. {3} — значит "ровно 3 штуки".
        # Последние две цифры \d{2} мы берем в круглые скобки — так мы просим скрипт их "запомнить".
        "pattern": r"\d{3}-\d{3}-\d{3}-(\d{2})",
        # match.group(1) достанет то, что попало в наши круглые скобки
        "replacer": lambda match: "***-***-***-" + match.group(1),
    },
    "name": {
        # [А-ЯЁ] ищет одну большую букву, [а-яё]+ ищет следующие за ней маленькие.
        # \s+ — это пробел между именем и фамилией.
        # Мы берем каждое слово в круглые скобки, чтобы скрипт запомнил их как группу 1 и группу 2.
        "pattern": r"([А-ЯЁ][а-яё]+)\s+([А-ЯЁ][а-яё]+)",
        # Достаем нулевой символ (первую букву) из первого слова, приклеиваем точку с пробелом,
        # потом берем первую букву из второго слова и тоже закрываем точкой.
        "replacer": lambda match: match.group(1)[0] + ". " + match.group(2)[0] + ".",
    },
    "number": {
        # Группа 1: (\+\d\s\(\d{3}\)\s) -> Ищет и запоминает кусок "+7 (999) "
        # Дальше идут цифры и дефисы: \d{3}-\d{2}-
        # Группа 2: (\d{2}) -> Ищет и запоминает последние 2 цифры "67"
        "pattern": r"(\+\d\s\(\d{3}\)\s)\d{3}-\d{2}-(\d{2})",
        # Склеиваем: Группа 1 + звездочки + Группа 2
        "replacer": lambda match: match.group(1) + "***-**-" + match.group(2),
    },
}


# 2. Создаем сам класс-движок
class Anonymizer:
    def __init__(self, rules):
        self.rules = rules

    def mask_text(self, text):
        result = text
        # Пробегаемся по всем правилам
        for rule_name, rule_data in self.rules.items():
            pattern = rule_data["pattern"]
            replacer = rule_data["replacer"]
            # re.sub ищет совпадения и заменяет их с помощью нашей функции replacer
            result = re.sub(pattern, replacer, result)

        return result


# 3. Тестируем наш движок!
if __name__ == "__main__":
    engine = Anonymizer(RULES)

    test_text = "Привет! Меня зовут Иван Иванов. Мой email maria@example.com, а номер паспорта 1234 567890. СНИЛС 123-456-789-45. Телефон +7 (999) 123-45-67."
    safe_text = engine.mask_text(test_text)

    print("Было: ", test_text)
    print("Стало:", safe_text)
